[
    {
        "name": "Book Store",
        "image": "../images/bookstore.png",
        "stack": ["React", "JavaScript", "HTML", "CSS"],
        "description": "A Book Store é uma aplicação web interativa, projetada para simular uma experiência de compra de livros online. A interface é composta por uma barra de navegação intuitiva com busca, acesso fácil ao carrinho de compras e opções de login. A página inicial apresenta alguns destaques, seções para lançamentos e best sellers, ambas com funcionalidade de adicionar livros ao carrinho, além de um convite para inscrição na Newsletter e um link para baixar o aplicativo da loja. O design é focado na usabilidade e na estética agradável, criando um ambiente convidativo para os usuários explorarem e comprarem livros. Este projeto demonstra habilidades em gerenciamento de estado e componentização no React, além de oferecer uma visão prática do desenvolvimento de e-commerce.",
        "deploy": "https://bookstore-l.vercel.app/",
        "github": "https://github.com/lucasecs92/book-store-react/blob/main/book-store/src/App.jsx"
    },
    {
        "name": "Weather App",
        "image": "../images/weather.png",
        "stack": ["React JS", "HTML", "CSS", "API"],
        "description": "O Weather App é uma aplicação interativa que permite aos usuários pesquisar e visualizar dados meteorológicos rápidos, confiáveis e em tempo real, a proveito da API OpenWeather. E utilizando um design responsivo e uma interface de usuário intuitiva, o aplicativo oferece uma experiência de usuário agradável e eficiente.",
        "deploy": "https://weather-l.vercel.app/",
        "github": "https://github.com/lucasecs92/weather-react/blob/main/weather/src/App.jsx"
    },
    {
        "name": "To Do List",
        "image": "../images/todolist.png",
        "stack": ["TypeScript", "React", "CSS"],
        "description": "O To Do List é uma aplicação web que oferece uma maneira simples e eficaz de gerenciar tarefas diárias. Com uma interface limpa e funcionalidades intuitivas, os usuários podem adicionar, editar, remover e marcar tarefas como concluídas com facilidade, assim sendo classificado como CRUD. O projeto demonstra o uso de estados e efeitos em React, além de práticas de desenvolvimento como a componentização e a gestão de estados locais e globais. O To Do List é uma ferramenta versátil que ajuda os usuários a manterem-se organizados e produtivos.",
        "deploy": "https://todolist-l.vercel.app/",
        "github": "https://github.com/lucasecs92/to-do-list/blob/main/todolist/src/App.tsx"
    },
    {
        "name": "Jogo Número Secreto",
        "image": "../images/jogo-numero-secreto.png",
        "stack": ["JavaScript Vanilla", "HTML", "CSS", "API"],
        "description": "Um jogo interativo de adivinhação que desafia os jogadores a descobrir um número secreto usando apenas suas vozes. Este jogo combina a adivinhação com a tecnologia moderna de reconhecimento de voz, proporcionando uma experiência única. Utilizando a API Web Speech para reconhecimento de voz, o jogo oferece uma maneira inovadora e acessível de jogar, permitindo que os jogadores interajam diretamente com o jogo falando seus palpites.",
        "deploy": "https://jogo-numero-secreto-l.vercel.app/",
        "github": "https://github.com/lucasecs92/jogo-numero-secreto/blob/main/index.html"
    }
]